spec/vcr_cassettes/invoices/multi_param_find_by_hash.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.fortnox.se/3/invoices/?ourreference=Radagast%20the%20Brown&yourreference=Gandalf%20the%20Grey
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/json
      Accept:
      - application/json
      Client-Secret:
      - 9aBA8ZgsvR
      Access-Token:
      - ccaef817-d5d8-4b1c-a316-54f3e55c5c54
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 12 Jul 2017 12:24:48 GMT
      Content-Type:
      - application/json
      Connection:
      - close
      Vary:
      - Accept-Encoding
      - Accept-Encoding
      X-Rack-Responsetime:
      - '33'
      X-Uid:
      - 4a7cca37
      X-Build:
      - 401ff9d5e0
    body:
      encoding: UTF-8
      string: '{"MetaInformation":{"@TotalResources":1,"@TotalPages":1,"@CurrentPage":1},"Invoices":[{"@url":"https:\/\/api.fortnox.se\/3\/invoices\/3","Balance":200,"Booked":false,"Cancelled":false,"Currency":"SEK","CurrencyRate":"1","CurrencyUnit":1,"CustomerName":"Updated
        customer","CustomerNumber":"1","DocumentNumber":"3","DueDate":"2016-03-17","ExternalInvoiceReference1":"","ExternalInvoiceReference2":"","InvoiceDate":"2016-03-16","NoxFinans":false,"OCR":"331","WayOfDelivery":"","TermsOfPayment":"0","Project":"","Sent":false,"Total":200}]}'
    http_version: 
  recorded_at: Wed, 12 Jul 2017 12:24:48 GMT
recorded_with: VCR 3.0.3
