spec/vcr_cassettes/orders/single_param_find_by_hash.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.fortnox.se/3/orders/?ourreference=Belladonna%20Took
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/json
      Accept:
      - application/json
      Client-Secret:
      - 9aBA8ZgsvR
      Access-Token:
      - ccaef817-d5d8-4b1c-a316-54f3e55c5c54
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Length:
      - '717'
      Content-Type:
      - application/json
      Date:
      - Mon, 22 Jan 2024 14:52:55 GMT
      Vary:
      - Accept-Encoding
      X-Build:
      - 9dd4e26746
      X-Frame-Options:
      - sameorigin
      X-Rack-Responsetime:
      - '60'
      X-Uid:
      - 93f61f2b
      Server:
      - Fortnox
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - '0'
      Referrer-Policy:
      - strict-origin-when-cross-origin
      Content-Security-Policy:
      - 'upgrade-insecure-requests;frame-ancestors https://*.fortnox.se;report-uri
        /api/cspreport;connect-src ''self'' https://a.storyblok.com wss://*.fortnox.se
        *.fortnox.se *.findity.com mybusiness.pwc.se themes.googleusercontent.com
        s3.amazonaws.com/helpjuice-static/ *.helpjuice.com *.vimeo.com fonts.googleapis.com
        fonts.gstatic.com fortnox.piwik.pro api.cling.se wss://api.cling.se ''unsafe-inline''
        ''unsafe-eval'' blob: data:'
      Strict-Transport-Security:
      - max-age=31536000; includeSubdomains
    body:
      encoding: ASCII-8BIT
      string: '{"MetaInformation":{"@TotalResources":2,"@TotalPages":1,"@CurrentPage":1},"Orders":[{"@url":"https:\/\/api.fortnox.se\/3\/orders\/8","Cancelled":false,"Currency":"SEK","CustomerName":"Old
        name","CustomerNumber":"1","DeliveryDate":null,"DocumentNumber":"8","ExternalInvoiceReference1":"","ExternalInvoiceReference2":"","OrderDate":"2016-04-21","OrderType":"Order","Project":"","Sent":false,"Total":0},{"@url":"https:\/\/api.fortnox.se\/3\/orders\/9","Cancelled":false,"Currency":"SEK","CustomerName":"Old
        name","CustomerNumber":"1","DeliveryDate":null,"DocumentNumber":"9","ExternalInvoiceReference1":"","ExternalInvoiceReference2":"","OrderDate":"2016-04-21","OrderType":"Order","Project":"","Sent":false,"Total":0}]}'
  recorded_at: Mon, 22 Jan 2024 14:52:55 GMT
recorded_with: VCR 6.2.0
